app/Http/Controllers/User/CartController.php

select * from `users` where `users`.`id` = 1 limit 1
---
  public function index(){
    $user = User::findOrFail(Auth::id());

select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id`, `carts`.`quantity` as `pivot_quantity` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` = 1
select * from `carts` where `product_id` = '104' and `user_id` = 1 limit 1
update `carts` set `quantity` = 10, `carts`.`updated_at` = '2022-11-18 14:50:38' where `id` = 1
insert into `carts` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (1, '104', '1', '2022-11-18 16:01:03', '2022-11-18 16:01:03')
---
    public function add(Request $request){

        $itemInCart=Cart::where('product_id', $request->product_id)
        ->where('user_id',Auth::id())->first();

        if($itemInCart){

            $itemInCart->quantity += $request->quantity;
            $itemInCart->save();
        }else{
            Cart::create([
                'user_id' => Auth::id(),
                'product_id' => $request->product_id,
                'quantity' => $request ->quantity
            ]);

delete from `carts` where `product_id` = '103' and `user_id` = 1
---
    public function delete($id){
        Cart::where('product_id',$id)
        ->where('user_id',Auth::id())
        ->delete();

select * from `users` where `users`.`id` = 1 limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 101
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (103, '2', -1, '2022-11-19 13:21:28', '2022-11-19 13:21:28')
---
    public function checkout(){
        $user = User::findOrFail(Auth::id());
        $products = $user->products;

        $lineItems = [];
        foreach($products as $product){
            $quantity = '';
            $quantity = Stock::where('product_id',$product->id)->sum('quantity');
            if($product->pivot->quantity > $quantity){
                return view('user.cart.index');
            }else{
                $lineItem = [
                    'name' =>$product->name,
                    'description' => $product->information,
                    'amount'=> $product ->price,
                    'currency' =>'jpy',
                    'quantity'=>$product->pivot->quantity,
                ];
                array_push($lineItems,$lineItem);
            }


        }
        //dd($lineItems);
        foreach($products as $product){
            Stock::create([
                'product_id'=>$product->id,
                'type'=> \Constant::PRODUCT_LIST['reduce'],
                'quantity'=>$product->pivot->quantity *-1
            ]);