app/Http/Controllers/User/CartController.php

    public function success()
    {
        Cart::where('user_id', Auth::id())->delete();
---
delete from `carts` where `user_id` = 1