app/Http/Controllers/User/ItemController.php

select * from `products` where `products`.`id` = '103' limit 1
---
    public function __construct()
    {
        $this->middleware('auth:users');
        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('item');
            if(!is_null($id)){
                $itemId = Product::availableItems()->where('products.id',$id)->exists();
                 if(!$itemId){
                 abort(404);
                 }
                 }
                 return $next($request);
        });

select * from `products` where `products`.`id` = '104' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 104
---
   public function show($id)
   {
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)
            ->sum('quantity');