app/Http/Controllers/Owner/ImageController.php

    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('image');
            if(!is_null($id)){
                $imagesOwnerId = Image::findOrFail($id)->owner->id;
---
select * from `images` where `images`.`id` = '3' limit 1
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1

    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
        ->orderBy('updated_at','desc')
        ->paginate(20);
---
select * from `images` where `owner_id` = 1 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 1

    public function store(UploadImageRequest $request)
    {
       $imageFiles = $request->file('files');
       if(!is_null( $imageFiles)){
        foreach($imageFiles as $imageFile){
            $NameToStore = ImageService::upload($imageFile,'products');
            Image::create([
                'owner_id'=> Auth::id(),
                'filename' =>  $NameToStore
            ]);
---
insert into `images` (`owner_id`, `filename`, `updated_at`, `created_at`) values (1, '1741813021_63718aaed4a35.jpg', '2022-11-14 09:24:15', '2022-11-14 09:24:15')

    public function edit($id)
    {
        $image = Image::findOrFail($id);
---
select * from `images` where `images`.`id` = '3' limit 1

    public function update(Request $request, $id)
    {
        $request->validate([
            'title' => ['string', 'max:50'],
        ]);
        $image =Image::findOrFail($id);
        $image->title = $request->title;
        $image->save();
---
select * from `images` where `images`.`id` = '1' limit 1
update `images` set `title` = 'テスト', `images`.`updated_at` = '2022-11-14 09:23:06' where `id` = 1

    public function destroy($id)
    {
        $image = Image::findOrFail($id);
       $imageInProducts =  Product::where('image1',$image->id)
        ->orWhere('image2',$image->id)
        ->orWhere('image3',$image->id)
        ->orWhere('image4',$image->id)
        ->get();

        if($imageInProducts){
            $imageInProducts->each(function($product) use($image){
                if($product->image1 === $image->id){
                    $product->image1 = null;
                    $product->save();
                }
                if($product->image2 === $image->id){
                    $product->image2 = null;
                    $product->save();
                }
                if($product->image3 === $image->id){
                    $product->image3 = null;
                    $product->save();
                }
                if($product->image4 === $image->id){
                    $product->image4 = null;
                    $product->save();
                }
            });
---
select * from `images` where `images`.`id` = '5' limit 1