app/Http/Controllers/Owner/ProductController.php

    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('product');
            if(!is_null($id)){
                $productsOwnerId = Product::findOrFail($id)->shop->owner->id;
                 $productId = (int)$productsOwnerId;
                 if($productId !== Auth::id()){
                 abort(404);
                 }
                 }
                 return $next($request);
        });
---
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` = '2' limit 1
select * from `shops` where `shops`.`id` = 1 limit 1
select * from `products` where `products`.`id` = '1' limit 1

    public function index()
    {
      // $products = Owner::findOrFail(Auth::id())->shop->product;
        $ownerInfo = Owner::with('shop.product.imageFirst')
        ->where('id',Auth::id())->get();
---
select * from `images` where `images`.`id` in (1)
select * from `owners` where `id` = 1 and `owners`.`deleted_at` is null
select * from `products` where `products`.`shop_id` in (1)
select * from `shops` where `shops`.`owner_id` in (1)

    public function create()
    {
        $shops = Shop::where('owner_id',Auth::id())
        ->select('id','name')
        ->get();

        $images = Image::where('owner_id',Auth::id())
        ->select('id','title','filename')
        ->orderBy('updated_at','desc')->get();

        $categories = PrimaryCategory::with('secondary')
        ->get();
---
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`

    public function store(ProductRequest $request)
    {

        try{
            DB::transaction(function () use($request){
                $product = Product::create([
                    'name' => $request->name,
                    'information' => $request->information,
                    'price' => $request->price,
                    'sort_order' => $request->sort_order,
                    'shop_id' => $request->shop_id,
                    'secondary_category_id'=>$request->category,
                    'image1' =>$request->image1,
                    'image2' =>$request->image2,
                    'image3' =>$request->image3,
                    'image4' =>$request->image4,
                    'is_selling' => $request->is_selling
                ]);
                Stock::create([
                    'product_id'=>$product->id,
                    'type'=> 1,
                    'quantity'=>$request->quantity
                ]);
---
insert into `products` (`name`, `information`, `price`, `sort_order`, `shop_id`, `secondary_category_id`, `image1`, `image2`, `image3`, `image4`, `is_selling`, `updated_at`, `created_at`) values ('aaaa', 'aaaa', '2420', '11', '1', '1', '1', '', '', '', '1', '2022-11-15 15:04:50', '2022-11-15 15:04:50')
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (1, 1, '11', '2022-11-15 15:04:50', '2022-11-15 15:04:50')

        public function edit($id)
        {
            $product = Product::findOrFail($id);
            $quantity = Stock::where('product_id', $product->id)
            ->sum('quantity');

            $shops = Shop::where('owner_id', Auth::id())
            ->select('id', 'name')
            ->get();

            $images = Image::where('owner_id', Auth::id())
            ->select('id', 'title', 'filename')
            ->orderBy('updated_at', 'desc')
            ->get();

            $categories = PrimaryCategory::with('secondary')
            ->get();
---
select * from `products` where `products`.`id` = '1' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 1
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`

    public function update(ProductRequest $request, $id)
    {
        $request->validate([
            'current_quantity' => ['required', 'integer',],
        ]);
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)
        ->sum('quantity');
---
select * from `products` where `products`.`id` = '3' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 3

                if($request->type ===\Constant::PRODUCT_LIST['reduce']){
                    $newQuantity = $request->quantity*-1;
                }
                    Stock::create([
                        'product_id'=>$product->id,
                        'type'=> $request->type,
                        'quantity'=>$newQuantity
                    ]);
---
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (1, '2', -20, '2022-11-16 16:57:43', '2022-11-16 16:57:43')