app/Http/Controllers/Owner/ShopController.php

select * from `shops` where `owner_id` = 1
---
    public function edit($id)
    {
        dd(Shop::findOrFail($id));